[
  {
    "title": "AgroPlus",
    "description": "Agriculture Innvation",
    "image": "/projectImages/p02.png",
    "image2": "/projectImages/p03.png",
    "image3": "/projectImages/routes3.png",
    "body": "Implemented features for buying and selling products, market price tracking, plant disease detection with solutions, group chat, View government policies . Integrated a chat-group to answer farmer queries in English and Gujarati, and provided live weather updates to users. Enhanced user experience with intuitive UI design, efficient data handling.",
    "technologies": ["React", "NodeJs", "ExpressJs", "Mongodb" ],
    "github": "https://github.com/krupalsavaliya234/Agro-Plus",
    "deployed": "https://norrinradd8.github.io/bike_buddy/",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "CampusBite",
    "description": "Canteen Management System ",
    "image": "/projectImages/weather.png",
    "image2": "/projectImages/storm.jpeg",
    "image3": "/projectImages/weather3.png",
    "technologies": ["EJs", "NodeJs", "ExpressJs", "Mongodb", "CSS"],
    "body": "Designed and implemented a user-friendly Canteen Management System enabling restaurant managers to add daily menus, receive and process customer orders, manage order completion, and maintain order history for enhanced service efficiency.Integrated the system using Express.js, Node.js, MongoDB, and EJS for efficient backend and dynamic frontend rendering. Ensured data integrity and optimized queries in MongoDB to handle large volumes of order data effectively",
    "github": "https://github.com/krupalsavaliya234/CampusBite",
    "deployed": "https://mdyeates.github.io/weather-app/",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  },
  {
    "title": "Notes",
    "description": "Daily Notes",
    "image": "/projectImages/team.png",
    "image2": "/projectImages/teamcelebrating.jpeg",
    "image3": "/projectImages/team3.png",
    "technologies": ["JavaScript", "Node", "Bootstrap", "Testing","Ejs","ExpressJs"],
    "body": "Designed and implemented a user-friendly DAily Notes , In this project everyone can add their notes and update and modify them . This mainly focus on Search Engine Optimization . Also provide a authentication for the better result.",
    "github": "https://github.com/krupalsavaliya234/Your-Secreat.git",
    "deployed": "https://drive.google.com/file/d/1_atUXTM-L9r4NccsrPaaWqPyNu37ftwH/view",
    "bgcolor": "#6c4bf4",
    "id": "3"
  },
  {
    "title": "Quiz",
    "description": "Test your knowledge",
    "image": "/projectImages/quiz.png",
    "image2": "/projectImages/javascript.jpeg",
    "image3": "/projectImages/quiz3.png",
    "technologies": ["JavaScript", "HTML", "CSS","NodeJs","ExpressJs","Mongoodb"],
    "body": "This application tests JavaScript knowledge through a timed, question-based quiz. Users are presented with 5 random questions and have 50 seconds to complete the quiz. The remaining time at completion determines the final score, rewarding both accuracy and speed.\nTo add challenge, the timer is reduced by 10 seconds for each incorrect answer. This creates urgency to answer carefully within the time limit. Questions are drawn randomly from a pool to ensure variety upon each attempt.\nBuilt using JavaScript, this project provides hands-on experience creating a responsive quiz application. Key learning outcomes include: \n➤ Generating random questions from a pool of options\n➤ Implementing a countdown timer with penalty deductions\n➤ Calculating scores based on time remaining\n➤ Providing interactive quiz feedback to users\nOverall, this application allows users to test their JavaScript skills through an engaging, time-pressured quiz interface. Both code knowledge and quick thinking are required to achieve a top score.",
    "github": "https://github.com/krupalsavaliya234",
    "deployed": "https://mdyeates.github.io/coding-quiz/",
    "bgcolor": "#f85781",
    "id": "4"
  }
]
